---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ShapesNotMatch
source: html/aca4b158-c8e0-ee2e-d245-318cb3db6fef.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.ShapesNotMatch Property

Shapes do not match. A connection could not be made.

## Syntax (C#)
```csharp
public static FailureDefinitionId ShapesNotMatch { get; }
```